// Создать очередь для целых (положительных и отрицательных) чисел. Максимальный размер
// очереди вводится с экрана. Создать функции для ввода и вывода элементов очереди. Ввести 6
// элементов (положительных и отрицательных). Вывести 2 первых отрицательных элемента очереди.

// Создать дек для целых (положительных и отрицательных) чисел. Максимальный размер дека
// вводится с экрана. Создать функции для ввода и вывода элементов дека. Ввести 6 элементов
// (положительных и отрицательных). Вывести 2 первых правых отрицательных элемента дека.

// Введите строку. Проанализировав в программе содержимое строки, выберите из нее числа и
// занесите в очередь. Выведите содержимое очереди на экран и посчитайте сумму этих чисел. Решение в
// программе оформляйте через подпрограммы.

//Могильный Владислав Александрович 16.04.2024

int main(){
    return 0;
}
